#### Terraform Format 🖌 `success`
#### Terraform Validate 🤖 `success`
#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
2025-10-15T06:45:37.442Z [INFO]  Terraform version: 1.12.1
2025-10-15T06:45:37.443Z [INFO]  Go runtime version: go1.24.2
2025-10-15T06:45:37.444Z [INFO]  CLI args: []string{"/opt/actions-runner/_work/_temp/b7fd6ac6-e65a-4bb2-8233-1aa141ab2212/terraform-bin", "plan", "-detailed-exitcode", "-no-color", "-var=region=eu-frankfurt-1", "-var=tenancy_ocid=dummy", "-var=user_ocid=dummy", "-var=fingerprint=dummy", "-var=private_key_path=dummy", "-var=private_key_password=dummy", "-var-file", "/opt/actions-runner/_work/oci-gitops-demoProject1/oci-gitops-demoProject1/oci/fra/compute/compute.json", "-var-file", "/opt/actions-runner/_work/oci-gitops-demoProject1/oci-gitops-demoProject1/oci/fra/database/database.json", "-var-file", "/opt/actions-runner/_work/oci-gitops-demoProject1/oci-gitops-demoProject1/oci/fra/project-network.json", "-out=tfplan.binary"}
2025-10-15T06:45:37.444Z [INFO]  CLI command args: []string{"plan", "-detailed-exitcode", "-no-color", "-var=region=eu-frankfurt-1", "-var=tenancy_ocid=dummy", "-var=user_ocid=dummy", "-var=fingerprint=dummy", "-var=private_key_path=dummy", "-var=private_key_password=dummy", "-var-file", "/opt/actions-runner/_work/oci-gitops-demoProject1/oci-gitops-demoProject1/oci/fra/compute/compute.json", "-var-file", "/opt/actions-runner/_work/oci-gitops-demoProject1/oci-gitops-demoProject1/oci/fra/database/database.json", "-var-file", "/opt/actions-runner/_work/oci-gitops-demoProject1/oci-gitops-demoProject1/oci/fra/project-network.json", "-out=tfplan.binary"}
2025-10-15T06:45:37.453Z [INFO]  backend-oracle_oci: Attempting to authenticate using instance principal credentials: operation=AuthConfigProvider req_id=41dc43ec-1f2d-1ca0-1cc0-79e40ba19e93
2025-10-15T06:45:38.497Z [INFO]  backend/local: starting Plan operation
2025-10-15T06:45:38.601Z [INFO]  backend-oracle_oci.terraform.tfstate.lock: Locking remote state: operation=lock-state-file req_id=09ab5d3e-301e-07f5-c2f1-103e6f819366
2025-10-15T06:45:38.652Z [INFO]  backend-oracle_oci.terraform.tfstate.lock: state lock response code: %+d
: operation=lock-state-file req_id=09ab5d3e-301e-07f5-c2f1-103e6f819366 EXTRA_VALUE_AT_END=200
2025-10-15T06:45:38.652Z [INFO]  backend-oracle_oci.terraform.tfstate: Downloading remote state: operation=download-state-file req_id=889c591b-494b-4c59-4fb3-fd7e98bc8997
2025-10-15T06:45:38.935Z [INFO]  provider: configuring client automatic mTLS
2025-10-15T06:45:38.959Z [INFO]  provider.terraform-provider-http_v3.5.0_x5: configuring server automatic mTLS: timestamp=2025-10-15T06:45:38.959Z
2025-10-15T06:45:38.995Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/hashicorp/http/3.5.0/linux_arm64/terraform-provider-http_v3.5.0_x5 id=420583
2025-10-15T06:45:38.995Z [INFO]  provider: configuring client automatic mTLS
2025-10-15T06:45:39.005Z [INFO]  provider.terraform-provider-local_v2.5.3_x5: configuring server automatic mTLS: timestamp=2025-10-15T06:45:39.005Z
2025-10-15T06:45:39.039Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/hashicorp/local/2.5.3/linux_arm64/terraform-provider-local_v2.5.3_x5 id=420591
2025-10-15T06:45:39.039Z [INFO]  provider: configuring client automatic mTLS
2025-10-15T06:45:39.049Z [INFO]  provider.terraform-provider-null_v3.2.4_x5: configuring server automatic mTLS: timestamp=2025-10-15T06:45:39.049Z
2025-10-15T06:45:39.083Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/hashicorp/null/3.2.4/linux_arm64/terraform-provider-null_v3.2.4_x5 id=420598
2025-10-15T06:45:39.083Z [INFO]  provider: configuring client automatic mTLS
2025-10-15T06:45:39.095Z [INFO]  provider.terraform-provider-template_v2.2.0_x4: configuring server automatic mTLS: timestamp=2025-10-15T06:45:39.095Z
2025-10-15T06:45:39.179Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/hashicorp/template/2.2.0/linux_arm64/terraform-provider-template_v2.2.0_x4 id=420605
2025-10-15T06:45:39.179Z [INFO]  provider: configuring client automatic mTLS
2025-10-15T06:45:39.190Z [INFO]  provider.terraform-provider-time_v0.13.1_x5: configuring server automatic mTLS: timestamp=2025-10-15T06:45:39.190Z
2025-10-15T06:45:39.224Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/hashicorp/time/0.13.1/linux_arm64/terraform-provider-time_v0.13.1_x5 id=420613
2025-10-15T06:45:39.224Z [INFO]  provider: configuring client automatic mTLS
2025-10-15T06:45:39.297Z [INFO]  provider.terraform-provider-oci_v7.22.0: configuring server automatic mTLS: timestamp=2025-10-15T06:45:39.297Z
2025-10-15T06:45:40.042Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/oracle/oci/7.22.0/linux_arm64/terraform-provider-oci_v7.22.0 id=420620
2025-10-15T06:45:40.473Z [INFO]  provider: configuring client automatic mTLS
2025-10-15T06:45:40.499Z [INFO]  provider.terraform-provider-local_v2.5.3_x5: configuring server automatic mTLS: timestamp=2025-10-15T06:45:40.496Z
2025-10-15T06:45:40.527Z [INFO]  provider: configuring client automatic mTLS
2025-10-15T06:45:40.538Z [INFO]  provider.terraform-provider-time_v0.13.1_x5: configuring server automatic mTLS: timestamp=2025-10-15T06:45:40.538Z
2025-10-15T06:45:40.568Z [INFO]  provider: configuring client automatic mTLS
2025-10-15T06:45:40.637Z [INFO]  provider.terraform-provider-oci_v7.22.0: configuring server automatic mTLS: timestamp=2025-10-15T06:45:40.637Z
2025-10-15T06:45:40.670Z [INFO]  provider: configuring client automatic mTLS
2025-10-15T06:45:40.686Z [INFO]  provider.terraform-provider-template_v2.2.0_x4: configuring server automatic mTLS: timestamp=2025-10-15T06:45:40.686Z
2025-10-15T06:45:40.789Z [INFO]  provider: configuring client automatic mTLS
2025-10-15T06:45:40.800Z [INFO]  provider.terraform-provider-http_v3.5.0_x5: configuring server automatic mTLS: timestamp=2025-10-15T06:45:40.800Z
2025-10-15T06:45:40.831Z [INFO]  provider: configuring client automatic mTLS
2025-10-15T06:45:40.841Z [INFO]  provider.terraform-provider-null_v3.2.4_x5: configuring server automatic mTLS: timestamp=2025-10-15T06:45:40.841Z
2025-10-15T06:45:40.871Z [INFO]  provider: configuring client automatic mTLS
2025-10-15T06:45:40.943Z [INFO]  provider.terraform-provider-oci_v7.22.0: configuring server automatic mTLS: timestamp=2025-10-15T06:45:40.943Z
2025-10-15T06:45:40.975Z [INFO]  provider: configuring client automatic mTLS
2025-10-15T06:45:41.066Z [INFO]  provider.terraform-provider-oci_v7.22.0: configuring server automatic mTLS: timestamp=2025-10-15T06:45:41.066Z
2025-10-15T06:45:41.292Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/oracle/oci/7.22.0/linux_arm64/terraform-provider-oci_v7.22.0 id=420642
2025-10-15T06:45:41.393Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/hashicorp/http/3.5.0/linux_arm64/terraform-provider-http_v3.5.0_x5 id=420657
2025-10-15T06:45:41.422Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/hashicorp/null/3.2.4/linux_arm64/terraform-provider-null_v3.2.4_x5 id=420664
2025-10-15T06:45:41.439Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/hashicorp/template/2.2.0/linux_arm64/terraform-provider-template_v2.2.0_x4 id=420649
2025-10-15T06:45:41.462Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/hashicorp/time/0.13.1/linux_arm64/terraform-provider-time_v0.13.1_x5 id=420635
2025-10-15T06:45:41.606Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/oracle/oci/7.22.0/linux_arm64/terraform-provider-oci_v7.22.0 id=420670
2025-10-15T06:45:41.612Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/oracle/oci/7.22.0/linux_arm64/terraform-provider-oci_v7.22.0 id=420677
2025-10-15T06:45:41.616Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/hashicorp/local/2.5.3/linux_arm64/terraform-provider-local_v2.5.3_x5 id=420627
2025-10-15T06:45:41.616Z [INFO]  backend/local: plan calling Plan
2025-10-15T06:45:42.195Z [INFO]  provider: configuring client automatic mTLS
2025-10-15T06:45:42.210Z [INFO]  provider.terraform-provider-time_v0.13.1_x5: configuring server automatic mTLS: timestamp=2025-10-15T06:45:42.210Z
2025-10-15T06:45:42.241Z [INFO]  provider: configuring client automatic mTLS
2025-10-15T06:45:42.252Z [INFO]  provider.terraform-provider-http_v3.5.0_x5: configuring server automatic mTLS: timestamp=2025-10-15T06:45:42.251Z
2025-10-15T06:45:42.282Z [INFO]  provider: configuring client automatic mTLS
2025-10-15T06:45:42.295Z [INFO]  provider.terraform-provider-template_v2.2.0_x4: configuring server automatic mTLS: timestamp=2025-10-15T06:45:42.295Z
2025-10-15T06:45:42.376Z [INFO]  provider: configuring client automatic mTLS
2025-10-15T06:45:42.450Z [INFO]  provider.terraform-provider-oci_v7.22.0: configuring server automatic mTLS: timestamp=2025-10-15T06:45:42.450Z
2025-10-15T06:45:42.481Z [INFO]  provider: configuring client automatic mTLS
2025-10-15T06:45:42.492Z [INFO]  provider.terraform-provider-local_v2.5.3_x5: configuring server automatic mTLS: timestamp=2025-10-15T06:45:42.492Z
2025-10-15T06:45:42.524Z [INFO]  provider: configuring client automatic mTLS
2025-10-15T06:45:42.603Z [INFO]  provider.terraform-provider-oci_v7.22.0: configuring server automatic mTLS: timestamp=2025-10-15T06:45:42.603Z
2025-10-15T06:45:42.635Z [INFO]  provider: configuring client automatic mTLS
2025-10-15T06:45:42.651Z [INFO]  provider.terraform-provider-null_v3.2.4_x5: configuring server automatic mTLS: timestamp=2025-10-15T06:45:42.651Z
2025-10-15T06:45:42.683Z [INFO]  provider: configuring client automatic mTLS
2025-10-15T06:45:42.775Z [INFO]  provider.terraform-provider-oci_v7.22.0: configuring server automatic mTLS: timestamp=2025-10-15T06:45:42.775Z
2025-10-15T06:45:45.082Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/oracle/oci/7.22.0/linux_arm64/terraform-provider-oci_v7.22.0 id=420706
2025-10-15T06:45:45.085Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/hashicorp/http/3.5.0/linux_arm64/terraform-provider-http_v3.5.0_x5 id=420691
2025-10-15T06:45:45.093Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/hashicorp/null/3.2.4/linux_arm64/terraform-provider-null_v3.2.4_x5 id=420727
2025-10-15T06:45:45.095Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/hashicorp/template/2.2.0/linux_arm64/terraform-provider-template_v2.2.0_x4 id=420698
2025-10-15T06:45:45.096Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/hashicorp/time/0.13.1/linux_arm64/terraform-provider-time_v0.13.1_x5 id=420684
2025-10-15T06:45:45.110Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/oracle/oci/7.22.0/linux_arm64/terraform-provider-oci_v7.22.0 id=420734
2025-10-15T06:45:45.112Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/hashicorp/local/2.5.3/linux_arm64/terraform-provider-local_v2.5.3_x5 id=420713
2025-10-15T06:45:45.116Z [WARN]  Provider "registry.terraform.io/oracle/oci" produced an invalid plan for module.oci_lz_autonomous_databases[0].oci_database_autonomous_database.autonomous_databases["atp-app1"], but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .defined_tags: planned value cty.UnknownVal(cty.Map(cty.String)) does not match config value cty.MapValEmpty(cty.String)
      - .nsg_ids: planned value cty.UnknownVal(cty.Set(cty.String)) does not match config value cty.SetValEmpty(cty.String)
      - .db_tools_details: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .encryption_key: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .long_term_backup_schedule: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .resource_pool_summary: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .scheduled_operations: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .customer_contacts: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2025-10-15T06:45:45.122Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/oracle/oci/7.22.0/linux_arm64/terraform-provider-oci_v7.22.0 id=420720
2025-10-15T06:45:45.610Z [INFO]  backend/local: plan operation completed
2025-10-15T06:45:45.610Z [INFO]  backend/local: writing plan output to: tfplan.binary

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.oci_lz_autonomous_databases[0].oci_database_autonomous_database.autonomous_databases["atp-app1"] will be created
  + resource "oci_database_autonomous_database" "autonomous_databases" {
      + actual_used_data_storage_size_in_tbs           = (known after apply)
      + additional_attributes                          = (known after apply)
      + admin_password                                 = (sensitive value)
      + allocated_storage_size_in_tbs                  = (known after apply)
      + apex_details                                   = (known after apply)
      + are_primary_whitelisted_ips_used               = (known after apply)
      + auto_refresh_frequency_in_seconds              = (known after apply)
      + auto_refresh_point_lag_in_seconds              = (known after apply)
      + autonomous_container_database_id               = (known after apply)
      + autonomous_database_backup_id                  = (known after apply)
      + autonomous_database_id                         = (known after apply)
      + autonomous_maintenance_schedule_type           = (known after apply)
      + availability_domain                            = (known after apply)
      + available_upgrade_versions                     = (known after apply)
      + backup_config                                  = (known after apply)
      + backup_retention_period_in_days                = (known after apply)
      + byol_compute_count_limit                       = (known after apply)
      + character_set                                  = (known after apply)
      + clone_table_space_list                         = (known after apply)
      + clone_type                                     = (known after apply)
      + cluster_placement_group_id                     = (known after apply)
      + compartment_id                                 = "ocid1.***REDACTED***"
      + compute_count                                  = 2
      + compute_model                                  = "ECPU"
      + connection_strings                             = (known after apply)
      + connection_urls                                = (known after apply)
      + cpu_core_count                                 = (known after apply)
      + data_safe_status                               = (known after apply)
      + data_storage_size_in_gb                        = (known after apply)
      + data_storage_size_in_tbs                       = 1
      + database_edition                               = (known after apply)
      + database_management_status                     = (known after apply)
      + dataguard_region_type                          = (known after apply)
      + db_name                                        = "dgcADB1"
      + db_version                                     = "19c"
      + db_workload                                    = "OLTP"
      + defined_tags                                   = (known after apply)
      + disaster_recovery_region_type                  = (known after apply)
      + disaster_recovery_type                         = (known after apply)
      + display_name                                   = "ATP demo 1"
      + encryption_key_history_entry                   = (known after apply)
      + failed_data_recovery_in_seconds                = (known after apply)
      + freeform_tags                                  = {
          + "Application" = "web-frontend"
          + "CostCenter"  = "IT-Database"
          + "Environment" = "Production"
          + "ManagedBy"   = "terraform-orchestrator"
          + "Project"     = "GitOps demo"
          + "Service"     = "autonomous-database"
          + "Tier"        = "database"
        }
      + id                                             = (known after apply)
      + in_memory_area_in_gbs                          = (known after apply)
      + in_memory_percentage                           = (known after apply)
      + infrastructure_type                            = (known after apply)
      + is_access_control_enabled                      = (known after apply)
      + is_auto_scaling_enabled                        = false
      + is_auto_scaling_for_storage_enabled            = false
      + is_backup_retention_locked                     = (known after apply)
      + is_data_guard_enabled                          = (known after apply)
      + is_dedicated                                   = false
      + is_dev_tier                                    = (known after apply)
      + is_disable_db_version_upgrade_schedule         = (known after apply)
      + is_free_tier                                   = false
      + is_local_data_guard_enabled                    = (known after apply)
      + is_mtls_connection_required                    = true
      + is_preview                                     = (known after apply)
      + is_preview_version_with_service_terms_accepted = (known after apply)
      + is_reconnect_clone_enabled                     = (known after apply)
      + is_refreshable_clone                           = (known after apply)
      + is_remote_data_guard_enabled                   = (known after apply)
      + is_replicate_automatic_backups                 = (known after apply)
      + is_schedule_db_version_upgrade_to_earliest     = (known after apply)
      + key_history_entry                              = (known after apply)
      + key_store_id                                   = (known after apply)
      + key_store_wallet_name                          = (known after apply)
      + kms_key_id                                     = (known after apply)
      + kms_key_lifecycle_details                      = (known after apply)
      + kms_key_version_id                             = (known after apply)
      + license_model                                  = "BRING_YOUR_OWN_LICENSE"
      + lifecycle_details                              = (known after apply)
      + local_adg_auto_failover_max_data_loss_limit    = (known after apply)
      + local_disaster_recovery_type                   = (known after apply)
      + local_standby_db                               = (known after apply)
      + maintenance_target_component                   = (known after apply)
      + max_cpu_core_count                             = (known after apply)
      + memory_per_compute_unit_in_gbs                 = (known after apply)
      + memory_per_oracle_compute_unit_in_gbs          = (known after apply)
      + ncharacter_set                                 = (known after apply)
      + net_services_architecture                      = (known after apply)
      + next_long_term_backup_time_stamp               = (known after apply)
      + nsg_ids                                        = (known after apply)
      + ocpu_count                                     = (known after apply)
      + open_mode                                      = (known after apply)
      + operations_insights_status                     = (known after apply)
      + peer_db_id                                     = (known after apply)
      + peer_db_ids                                    = (known after apply)
      + permission_level                               = (known after apply)
      + private_endpoint                               = (known after apply)
      + private_endpoint_ip                            = (known after apply)
      + private_endpoint_label                         = (known after apply)
      + provisionable_cpus                             = (known after apply)
      + public_connection_urls                         = (known after apply)
      + public_endpoint                                = (known after apply)
      + refreshable_mode                               = (known after apply)
      + refreshable_status                             = (known after apply)
      + remote_disaster_recovery_configuration         = (known after apply)
      + remote_disaster_recovery_type                  = (known after apply)
      + resource_pool_leader_id                        = (known after apply)
      + role                                           = (known after apply)
      + secret_id                                      = (known after apply)
      + secret_version_number                          = (known after apply)
      + security_attributes                            = (known after apply)
      + service_console_url                            = (known after apply)
      + shrink_adb_trigger                             = (known after apply)
      + source                                         = (known after apply)
      + source_id                                      = (known after apply)
      + standby_db                                     = (known after apply)
      + standby_whitelisted_ips                        = (known after apply)
      + state                                          = (known after apply)
      + subnet_id                                      = (known after apply)
      + subscription_id                                = (known after apply)
      + supported_regions_to_clone_to                  = (known after apply)
      + system_tags                                    = (known after apply)
      + time_created                                   = (known after apply)
      + time_data_guard_role_changed                   = (known after apply)
      + time_deletion_of_free_autonomous_database      = (known after apply)
      + time_disaster_recovery_role_changed            = (known after apply)
      + time_earliest_available_db_version_upgrade     = (known after apply)
      + time_latest_available_db_version_upgrade       = (known after apply)
      + time_local_data_guard_enabled                  = (known after apply)
      + time_maintenance_begin                         = (known after apply)
      + time_maintenance_end                           = (known after apply)
      + time_of_auto_refresh_start                     = (known after apply)
      + time_of_joining_resource_pool                  = (known after apply)
      + time_of_last_failover                          = (known after apply)
      + time_of_last_refresh                           = (known after apply)
      + time_of_last_refresh_point                     = (known after apply)
      + time_of_last_switchover                        = (known after apply)
      + time_of_next_refresh                           = (known after apply)
      + time_reclamation_of_free_autonomous_database   = (known after apply)
      + time_scheduled_db_version_upgrade              = (known after apply)
      + time_undeleted                                 = (known after apply)
      + time_until_reconnect_clone_enabled             = (known after apply)
      + timestamp                                      = (known after apply)
      + total_backup_storage_size_in_gbs               = (known after apply)
      + use_latest_available_backup_time_stamp         = (known after apply)
      + used_data_storage_size_in_gbs                  = (known after apply)
      + used_data_storage_size_in_tbs                  = (known after apply)
      + vault_id                                       = (known after apply)

      + customer_contacts (known after apply)

      + db_tools_details (known after apply)

      + encryption_key (known after apply)

      + long_term_backup_schedule (known after apply)

      + resource_pool_summary (known after apply)

      + scheduled_operations (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + autonomous_databases_connection_strings = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"
2025-10-15T06:45:45.751Z [INFO]  backend-oracle_oci.terraform.tfstate.lock: unlocking remote state: operation=unlock-state-file req_id=019ee1fc-6cda-2407-69b6-078007361ed5
2025-10-15T06:45:45.781Z [INFO]  backend-oracle_oci.terraform.tfstate.lock: Unlock response: %v
: operation=unlock-state-file req_id=019ee1fc-6cda-2407-69b6-078007361ed5 EXTRA_VALUE_AT_END=204
```

</details>

*Pushed by: @iblake*